[
    {
        "title": "Blumhouse producer says 'Exorcist: Believer' is a direct sequel to the original, and not connected to the rest of the franchise",
        "url": "https://www.inverse.com/entertainment/exorcist-believer-canon-sequel-deceiver-megan-2-executive-producer-interview",
        "subreddit": "horror",
        "score": 766,
        "commentsCount": 224,
        "post": {
            "content": ""
        }
    },
    {
        "title": "Aborted The Thing sequel would’ve been set on an oil rig",
        "url": "https://www.syfy.com/syfy-wire/the-thing-2011-prequel-director-reveals-scrapped-sequel-idea-exclusive",
        "subreddit": "horror",
        "score": 206,
        "commentsCount": 29,
        "post": {
            "content": "A sequel to the 2011 The Thing prequel was considered, which would’ve found Kate escaping to an oil rig while trying to warn the world about the alien creature."
        }
    },
    {
        "title": "Movies where characters are eaten whole?",
        "url": "https://www.reddit.com/r/horror/comments/16vljcp/movies_where_characters_are_eaten_whole/",
        "subreddit": "horror",
        "score": 197,
        "commentsCount": 405,
        "post": {
            "content": "Okay, first off, no, I don't have a vore kink, quite the opposite in fact, this is a pretty big phobia of mine so it makes a horror movie pretty effective for me. I'm wondering what are some films where characters are eaten whole (or at least mostly), rather than bite by bite as in most zombie movies etc. Some examples that come to mind are Anaconda, Nope, Deep Rising, The Meg 2 (not an otherwise scary movie but there is a shot inside the megs mouth that freaks me right out). Thanks!"
        }
    },
    {
        "title": "What are the most depressing, bleak horror movies you have ever seen? Make me call my therapist.",
        "url": "https://www.reddit.com/r/horror/comments/16w5jvs/what_are_the_most_depressing_bleak_horror_movies/",
        "subreddit": "horror",
        "score": 182,
        "commentsCount": 485,
        "post": {
            "content": "What the title says. Looking for movies that I can probably only watch once. Love shit that is disturbing and unsettling, but would like to keep it under the umbrella of horror. Bonus points if there’s some tragic drama/romance. \n\nFuck me up."
        }
    },
    {
        "title": "Does anyone else have something that they can’t stand in horror movies?",
        "url": "https://www.reddit.com/r/horror/comments/16vpyhh/does_anyone_else_have_something_that_they_cant/",
        "subreddit": "horror",
        "score": 135,
        "commentsCount": 303,
        "post": {
            "content": "I can’t deal with eye torture. I made it through like 20 minutes of Terrifier 2 and that scene just made me tap out. I hate when people’s eyes are gouged out, anything of the sort. Not much else bothers me that much except for if animals are hurt, I can’t watch that. Does anyone else have something really specific that bothers them? I’ve definitely become desensitized to a lot of stuff but I don’t think I’ll ever get used to eye stuff. I typically find that it’s only really in super gory films, which I don’t normally watch anyway."
        }
    }
]